print('Задача 4. Недоделка 2')

# Вы всё так же работаете в конторе по разработке игр и смотрите различные программы прошлого горе-программиста. В одной из игр для детей, связанной с мультяшной работой с числами, вам нужно было написать код согласно следующим условиям: программа получает на вход два числа; в первом числе должно быть не менее трёх цифр, во втором — не менее четырёх, иначе программа выдаёт ошибку. Если всё нормально, то в каждом числе первая и последняя цифры меняются местами, а затем выводится их сумма.

# И тут вы натыкаетесь на программу, которая была написана предыдущим программистом и которая как раз решает такую задачу. Однако старший программист попросил вас немного переписать этот код, чтобы он не выглядел так ужасно. Да и вам самим становится, мягко говоря, не по себе от него.

# Постарайтесь разделить логику кода на три отдельные логические части (функции):
# count_numbers — получает число и возвращает количество цифр в числе;
# change_number — получает число, меняет в нём местами первую и последнюю цифры и возвращает изменённое число;
# main — функция ничего не получает на вход, внутри она запрашивает нужные данные от пользователя, выполняет дополнительные проверки и вызывает функции 1 и 2 для выполнения задачи (проверки и изменения двух чисел).

# Разбейте приведённую ниже программу на функции. Повторений кода должно быть как можно меньше. Также сделайте, чтобы в основной части программы был только ввод чисел, затем изменённые числа и вывод их суммы.

def count_numbers(num):
    return len(str(num))

def change_number(num):
    temp = str(num)
    return int(temp[-1] + temp[1:-1] + temp[0])

def main():
    first_num = int(input('Введите первое число: '))
    if count_numbers(first_num) < 3:
        print('Число должно содержать не менее трёх цифр')
        return

    second_num = int(input('Введите второе число: '))
    if count_numbers(second_num) < 4:
        print('Число должно содержать не менее четырех цифр')
        return

    first_num = change_number(first_num)
    second_num = change_number(second_num)

    print(f'Сумма чисел: {first_num + second_num}')

main()

print()